/* Пользователь вводит 2 числа и опрерацию (+, -, *, /). 
Вывести результат или сообщение о ошибке.*/
var x = 5, y = -7, z;
z = x * y;
if ((z == x * y) && (z != x + y) && (z != x - y) && (z != x / y)) {
    console.log("произведение чисел равно", z);
} else if ((z != x * y) && (z == x + y) && (z != x - y) && (z != x / y)) {
    console.log("сумма чисел равна", z);
} else if ((z != x * y) && (z != x + y) && (z == x - y) && (z != x / y)) {
    console.log("разница чисел равна", z);
} else if ((y != 0) && (z != x * y) && (z != x + y) && (z != x - y) && (z == x / y)) {
    console.log("частное чисел равно", z);
} else if ((y == 0) && (z != x * y) && (z != x + y) && (z != x - y) && (z == x / y)) {
    console.log("Делить на ноль нельзя \nИзмените значение делителя");
} else {
    console.log("ноль")
}